Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetReportProperty Method
Overload List
Name | Description
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace